In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
r_cols = ['user_id', 'isbn', 'rating']
rating = pd.read_csv(r'C:/Users/krina/book/rating.csv', sep=';', names=r_cols, usecols=range(3), encoding='latin-1', header=0, low_memory=False)

b_cols = ['isbn', 'title', 'author', 'year']
book = pd.read_csv(r'C:/Users/krina/book/book.csv', sep=';', names=b_cols, usecols=range(4), encoding='latin-1', header=0, low_memory=False)

u_cols = ['user_id', 'location', 'age']
user = pd.read_csv(r'C:/Users/krina/book/user.csv', sep=';', names=u_cols, usecols=range(3), encoding='latin-1', header=0, low_memory=False)

In [3]:
rating.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726  0155061224       5
2   276727  0446520802       0
3   276729  052165615X       3
4   276729  0521795028       6

In [4]:
rating.shape

(1149780, 3)

In [5]:
book.head()

,isbn,title,author,year
0,0195153448,Classical Mythology,Mark P. O. Morford,2002
1,0002005018,Clara Callan,Richard Bruce Wright,2001
2,0060973129,Decision in Normandy,Carlo D'Este,1991
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999

In [6]:
df1 = pd.merge(book,rating)

In [7]:
df1.head()

,isbn,title,author,year,user_id,rating
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,2,0
1,0002005018,Clara Callan,Richard Bruce Wright,2001,8,5
2,0002005018,Clara Callan,Richard Bruce Wright,2001,11400,0
3,0002005018,Clara Callan,Richard Bruce Wright,2001,11676,8
4,0002005018,Clara Callan,Richard Bruce Wright,2001,41385,0

In [8]:
df1.shape

(1031175, 6)

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1031175 entries, 0 to 1031174
Data columns (total 6 columns):
isbn       1031175 non-null object
title      1031175 non-null object
author     1031174 non-null object
year       1031175 non-null object
user_id    1031175 non-null int64
rating     1031175 non-null int64
dtypes: int64(2), object(4)
memory usage: 55.1+ MB

In [10]:
df1.head()

,isbn,title,author,year,user_id,rating
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,2,0
1,0002005018,Clara Callan,Richard Bruce Wright,2001,8,5
2,0002005018,Clara Callan,Richard Bruce Wright,2001,11400,0
3,0002005018,Clara Callan,Richard Bruce Wright,2001,11676,8
4,0002005018,Clara Callan,Richard Bruce Wright,2001,41385,0

In [11]:
non_zero = df1[df1['rating'] != 0]

In [12]:
non_zero.head()

         isbn         title                author  year  user_id  rating
1  0002005018  Clara Callan  Richard Bruce Wright  2001        8       5
3  0002005018  Clara Callan  Richard Bruce Wright  2001    11676       8
5  0002005018  Clara Callan  Richard Bruce Wright  2001    67544       8
8  0002005018  Clara Callan  Richard Bruce Wright  2001   116866       9
9  0002005018  Clara Callan  Richard Bruce Wright  2001   123629       9

In [13]:
df = df1[df1['rating'].isin(non_zero['rating'])]

In [14]:
df.head()

         isbn         title                author  year  user_id  rating
1  0002005018  Clara Callan  Richard Bruce Wright  2001        8       5
3  0002005018  Clara Callan  Richard Bruce Wright  2001    11676       8
5  0002005018  Clara Callan  Richard Bruce Wright  2001    67544       8
8  0002005018  Clara Callan  Richard Bruce Wright  2001   116866       9
9  0002005018  Clara Callan  Richard Bruce Wright  2001   123629       9

In [15]:
df.shape

(383852, 6)

In [16]:
counts = df['isbn'].value_counts()
df = df[df['isbn'].isin(counts[counts >= 20].index)]

In [17]:
df.shape

(95580, 6)

In [18]:
ratings = pd.DataFrame(df.groupby('title')['rating'].mean())

In [19]:
ratings.head()

                       rating
title
1984                 8.772277
1st to Die: A Novel  7.711864
2010: Odyssey Two    7.413793
24 Hours             7.708333
2nd Chance           7.771812

In [20]:
ratings['num of ratings'] = pd.DataFrame(df.groupby('title')['rating'].count())

In [21]:
ratings['num of ratings'].head()

title
1984                   101
1st to Die: A Novel    236
2010: Odyssey Two       29
24 Hours                24
2nd Chance             149
Name: num of ratings, dtype: int64

In [22]:
ratings.sort_values('num of ratings', ascending=False).head(10)

                                                   rating  num of ratings
title
The Lovely Bones: A Novel                        8.185290             707
Wild Animus                                      4.390706             581
The Da Vinci Code                                8.435318             487
The Secret Life of Bees                          8.466501             403
The Nanny Diaries: A Novel                       7.437659             393
The Red Tent (Bestselling Backlist)              8.182768             383
Bridget Jones's Diary                            7.637333             375
A Painted House                                  7.392265             362
Life of Pi                                       8.062500             320
Divine Secrets of the Ya-Ya Sisterhood: A Novel  7.887500             320

In [23]:
book_mat = df.pivot_table(index='user_id', columns='title', values='rating')

In [24]:
book_mat.head()

title,1984,1st to Die: A Novel,2010: Odyssey Two,24 Hours,2nd Chance,3rd Degree,4 Blondes,50 Simple Things You Can Do to Save the Earth,84 Charing Cross Road,A 2nd Helping of Chicken Soup for the Soul (Chicken Soup for the Soul Series (Paper)),...,Year of Wonders,Year of Wonders: A Novel of the Plague,You Belong To Me,You Shall Know Our Velocity,Yukon Ho!,Zen and the Art of Motorcycle Maintenance: An Inquiry into Values,Zodiac: The Eco-Thriller,"\O\"" Is for Outlaw""",e,stardust
user_id,,,,,,,,,,,,,,,,,,,,,
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [25]:
your_book = book_mat['Atlas Shrugged']

In [26]:
#another_high_book = book_mat['0316666343']

In [27]:
similar_to_your_book = book_mat.corrwith(your_book)
#similar_to_another_book = book_mat.corrwith(another_high_book)

C:\Users\krina\Anaconda3\lib\site-packages\numpy\lib\function_base.py:2392: RuntimeWarning: Degrees of freedom <= 0 for slice
  c = cov(x, y, rowvar)
C:\Users\krina\Anaconda3\lib\site-packages\numpy\lib\function_base.py:2326: RuntimeWarning: divide by zero encountered in true_divide
  c *= np.true_divide(1, fact)

In [28]:
corr_your_book = pd.DataFrame(similar_to_your_book,columns=['Correlation'])
corr_your_book.dropna(inplace=True)
corr_your_book.head()

                                           Correlation
title
1984                                          0.866025
A Fine Balance                                1.000000
A Heartbreaking Work of Staggering Genius     0.981981
A Map of the World                            0.866025
A Prayer for Owen Meany                       0.917663

In [29]:
corr_your_book = corr_your_book.join(ratings['num of ratings'])

In [30]:
corr_your_book.head(10)

,Correlation,num of ratings
title,,
1984,0.866025,101
A Fine Balance,1.000000,58
A Heartbreaking Work of Staggering Genius,0.981981,144
A Map of the World,0.866025,111
A Prayer for Owen Meany,0.917663,181
A Walk in the Woods: Rediscovering America on the Appalachian Trail (Official Guides to the Appalachian Trail),-1.000000,106
A Year in Provence,-1.000000,67
About a Boy,-0.866025,101
About a Boy (Movie Tie-In),-1.000000,56
Airframe,-1.000000,125

In [31]:
#your_choice = corr_your_book[corr_your_book['num of ratings'] >= 50].sort_values('Correlation', ascending=False).head(20)

In [32]:
#your_choice

### Collaborative fitering using k nearest neighbours

In [33]:
rating_no = ratings.sort_values('num of ratings', ascending=False)

In [34]:
rating_no.head()

                              rating  num of ratings
title
The Lovely Bones: A Novel   8.185290             707
Wild Animus                 4.390706             581
The Da Vinci Code           8.435318             487
The Secret Life of Bees     8.466501             403
The Nanny Diaries: A Novel  7.437659             393

In [35]:
rating_no['num of ratings'].describe()

count    1910.000000
mean       50.041885
std        51.013359
min        20.000000
25%        24.000000
50%        32.000000
75%        54.000000
max       707.000000
Name: num of ratings, dtype: float64

In [36]:
popular_book = rating_no[rating_no['num of ratings'] >= 50]

In [37]:
popular_book.count()

rating            553
num of ratings    553
dtype: int64

In [38]:
popular_book.head()

                              rating  num of ratings
title
The Lovely Bones: A Novel   8.185290             707
Wild Animus                 4.390706             581
The Da Vinci Code           8.435318             487
The Secret Life of Bees     8.466501             403
The Nanny Diaries: A Novel  7.437659             393